package com.ansiyida.cgjl.util;

public class GetCityUtil {
    /** 一级菜单名称数组 **/
    public static String[] GroupNameArray = { "全国", "北京市", "天津市", "河北省", "山西省", "内蒙古自治区", "辽宁省","吉林省","黑龙江省","上海市","江苏省","安徽省","浙江省","福建省","江西省"
            ,"山东省","河南省","湖北省","湖南省","广东省","广西壮族自治区","海南省","重庆市","四川省","贵州省","云南省","西藏自治区","陕西省","甘肃省","青海省","新疆维吾尔自治区","台湾省"
            ,"香港特别行政区","澳门特别行政区"};
    /** 二级菜单名称数组 **/
    public static String[][] childNameArray = { {"全国"},
            { "北京市" },
            { "天津市" },
            { "石家庄市" ,"安国市" ,"保定市" ,"霸州市" ,"泊头市" ,"沧州市" ,"承德市" ,"定州市" ,"丰南市" ,"高牌店市"
                    ,"蒿城市" ,"邯郸市" ,"河间市" ,"衡水市" ,"黄骅市" ,"晋州市" ,"冀州市" ,"廊坊市" ,"鹿泉市" ,"南宫市"
                    ,"秦皇岛市" ,"任丘市" ,"三河市" ,"沙河市" ,"深州市" ,"唐山市" ,"武安市" ,"邢台市" ,"辛集市"  ,"新乐市"
                    ,"张家口市" ,"涿州市" ,"遵化市"},
            { "太原市"  ,"长治市"  ,"大同市"  ,"高平市"  ,"古交市"  ,"河津市"  ,"侯马市"  ,"霍州市"  ,"介休市"  ,"晋城市"
                    ,"临汾市"  ,"潞城市"  ,"朔州市"  ,"孝义市"  ,"忻州市"  ,"阳泉市"  ,"永济市"  ,"原平市"  ,"榆次市","运城市"},
            { "呼和浩特市" ,"包头市" ,"赤峰市" ,"东胜市" ,"二连浩特市" ,"额尔古纳市" ,"丰镇市" ,"根河市" ,"海拉尔市" ,"霍林郭勒市"
                    ,"集宁市" ,"临河市" ,"满洲里市" ,"通辽市" ,"乌兰浩特市" ,"乌海市" ,"锡林浩特市" ,"牙克石市" ,"扎兰屯市" },
            {"沈阳市" ,"鞍山市" ,"北票市" ,"本溪市" ,"朝阳市" ,"大连市" ,"丹东市" ,"大石桥市" ,"东港市" ,"风城市"
                    ,"抚顺市" ,"阜新市" ,"盖州市" ,"海城市" ,"葫芦岛市" ,"锦州市" ,"开原市" ,"辽阳市" ,"凌海市" ,"凌源市"
                    ,"盘锦市" ,"普兰店市" ,"铁法市" ,"铁岭市" ,"瓦房店市" ,"兴城市" ,"新民市" ,"营口市" ,"庄河市" },
            {"长春市" ,"白城市" ,"白山市" ,"大安市" ,"德惠市" ,"敦化市" ,"公主岭市" ,"和龙市" ,"桦甸市" ,"珲春市"
                    ,"集安市" ,"蛟河市" ,"吉林市" ,"九台市" ,"辽源市" ,"临江市" ,"龙井市" ,"梅河口市" ,"舒兰市" ,"四平市"
                    ,"松原市" ," 南市" ,"通化市" ,"图们市" ,"延吉市" ,"愉树市"},{"哈尔滨市" ,"阿城市" ,"安达市" ,"北安市" ,"大庆市" ,"富锦市" ,"海林市" ,"海伦市" ,"鹤岗市" ,"黑河市"
            ,"佳木斯市" ,"鸡西市" ,"密山市" ,"牡丹江市" ,"讷河市" ,"宁安市" ,"齐齐哈尔市" ,"七台河市" ,"双城市" ,"尚志市"
            ,"双鸭山市" ,"绥芬河市" ,"绥化市" ,"铁力市" ,"同江市" ,"五常市" ,"五大连池市" ,"伊春市" ,"肇东市"},{"上海市"},{"南京市" ,"常熟市" ,"常州市" ,"丹阳市" ,"东台市" ,"高邮市" ,"海门市" ,"淮安市" ,"淮阴市" ,"江都市"
            ,"姜堰市" ,"江阴市" ,"靖江市" ,"金坛市" ,"昆山市", "连云港市" ,"溧阳市" ,"南通市" ,"邳州市" ,"启乐市"
            ,"如皋市" ,"宿迁市" ,"苏州市" ,"太仓市" ,"泰兴市" ,"泰州市","通州市" ,"吴江市" ,"无锡市" ,"兴化市"
            ,"新沂市","徐州市" ,"盐城市" ,"扬中市" ,"扬州市" ,"宜兴市" ,"仪征市" ,"张家港市" ,"镇江市"},{ "合肥市","安庆市","蚌埠市","亳州市","巢湖市","滁州市","阜阳市","贵池市","淮北市"
            ,"淮南市","黄山市","界首市","六安市","马鞍山市","明光市","宿州市","天长市","铜陵市","芜湖市","宣州市"},{"杭州市" ,"宁波市" ,"温州市" ,"嘉兴市" ,"湖州市" ,"绍兴市" ,"金华市" ,"衢州市" ,"舟山市" ,"台州市"
            ,"丽水市"},{"福州市" ,"厦门市" ,"莆田市" ,"三明市" ,"泉州市" ,"漳州市" ,"南平市" ,"龙岩市" ,"宁德市"},{"南昌市" ,"景德镇市" ,"萍乡市" ,"九江市" ,"新余市" ,"鹰潭市" ,"赣州市" ,"吉安市" ,"宜春市" ,"抚州市"
            ,"上饶市"},{"济南市" ,"青岛市" ,"淄博市" ,"枣庄市" ,"东营市" ,"烟台市" ,"潍坊市" ,"济宁市" ,"泰安市" ,"威海市"
            ,"日照市" ,"莱芜市" ,"临沂市" ,"德州市" ,"聊城市" ,"滨州市" ,"菏泽市"},{"郑州市" ,"开封市" ,"洛阳市" ,"平顶山市" ,"安阳市" ,"鹤壁市" ,"新乡市" ,"焦作市" ,"濮阳市" ,"许昌市"
            ,"漯河市" ,"三门峡市" ,"南阳市" ,"商丘市" ,"信阳市" ,"周口市" ,"驻马店市"},{"武汉市" ,"黄石市" ,"十堰市" ,"宜昌市" ,"襄樊市" ,"鄂州市" ,"荆门市" ,"孝感市" ,"荆州市" ,"黄冈市"
            ,"咸宁市" ,"随州市" ,"恩施土家族苗族自治州"},{"长沙市" ,"株洲市" ,"湘潭市" ,"衡阳市" ,"邵阳市" ,"岳阳市" ,"常德市" ,"张家界市" ,"益阳市" ," 郴州市"
            ,"永州市" ,"怀化市" ,"娄底市" ,"湘西土家族苗族自治州"},{"广州市" ,"韶关市" ,"深圳市" ,"珠海市" ,"汕头市" ,"佛山市" ,"江门市" ,"湛江市" ,"茂名市" ,"肇庆市"
            ,"惠州市" ,"梅州市" ,"汕尾市" ,"河源市" ,"阳江市" ,"清远市" ,"东莞市" ,"中山市" ,"潮州市" ,"揭阳市"
            ,"云浮市"},{"南宁市" ,"柳州市" ,"桂林市" ,"梧州市" ,"北海市" ,"防城港市" ,"钦州市" ,"贵港市" ,"玉林市" ," 百色市"
            ,"贺州市" ,"河池市" ,"来宾市" ,"崇左市"},{"海口市" ,"三亚市"},{"重庆市"},{"成都市" ,"自贡市" ,"攀枝花市" ,"泸州市" ,"德阳市" ,"绵阳市" ,"广元市" ,"遂宁市" ,"内江市" ,"乐山市"
            ,"南允市" ,"眉山市" ,"宜宾市" ,"广安市" ,"达州市" ,"雅安市" ,"巴中市" ,"资阳市" ,"阿坝藏族羌族自治州" ,"甘孜藏族自治州"
            ,"凉山彝族自治州"},{"贵阳市" ,"六盘水市" ,"遵义市" ,"安顺市" ,"铜任地区" ,"黔西南布依族苗族自治州" ,"毕节地区" ,"黔东南苗族侗族自治州" ,"黔南布依族苗族自治州"},{"昆明市" ,"曲靖市" ,"玉溪市" ,"保山市" ,"昭通市" ,"丽江市" ,"普洱市" ,"临沧市" ,"楚雄彝族自治州" ,"红河哈尼族彝族自治州"
            ,"文山壮族苗族自治州" ,"西双版纳傣族自治州" ,"大理白族自治州" ,"德宏傣族景颇族自治州" ,"怒江傈傈族自治州" ,"迪庆藏族自治州"},{"拉萨市" ,"昌都地区" ,"山南地区" ,"日喀则地区" ,"那曲地区" ,"阿里地区" ,"林芝地区"
    },{"西安市" ,"铜川市" ,"宝鸡市" ,"咸阳市" ,"渭南市" ,"延安市" ,"汉中市" ,"榆林市" ,"安康市" ,"商洛市"},{"兰州市" ,"嘉峪关市" ,"金昌市" ,"白银市" ,"天水市" ,"武威市" ,"张掖市" ,"平凉市" ,"酒泉市" ,"庆阳市"
            ,"定西市" ,"陇南市" ,"临夏回族自治州" ,"甘南藏族自治州"},{"西宁市" ,"海东地区" ,"海北藏族自治州" ,"黄南藏族自治州" ,"海南藏族自治州" ,"果洛藏族自治州"
            ,"玉树藏族自治州" ,"海西蒙古族藏族自治州"},{"乌鲁木齐市" ,"克拉玛依市" ,"吐鲁番地区" ,"哈密地区" ,"昌吉回族自治州" ,"博尔塔拉蒙古自治州" ,"巴音郭楞蒙古自治州" ,"阿克苏地区" ,"克孜勒苏柯尔克孜自治州" ,"喀什地区"
            ,"和田地区" ,"伊犁哈萨克自治州" ,"塔城地区" ,"阿勒泰地区"},{"台湾省"},{"香港特别行政区"},{"澳门特别行政区"}
    };
}
